
/*
 * 数据对象、 左值、 右值、 和运算符的概念
 *  
 *  (1)数据表达式与数据对象
 * 
 *    赋值表达式语句的目的是把值储存到内存位置上。 用于储存值的数据存储区域统称为数据对象（data object） 。
 *  例：
 *     int a; a = 3; 此时a是数据对象
 * 
 *  (2)左值
 *     
 *     左值（lvalue） 是 C 语言的术语， 用于标识特定数据对象的名称或表达式。 因此， 对象指的是实际的数据存储，
 *     而左值是用于标识或定位存储位置的标签。可以简单的理解位等号左边的值。
 *   例：
 *     int a; a = 3; 此时a是左值，又是数据对象。具体而言，a是这个存储位置的标签，我们知道a是说的这块存储的位置。
 *      
 *     对于早期的C语言来说左值意味着
 *     a.它指定一个对象， 所以引用内存中的地址；
 *     b.它可用在赋值运算符的左侧， 左值（lvalue） 中的l源自left，左值是可以更改的。
 *     
 *     对于c89来说引入了const限定符，用const创建的变量不可修改（不能放在赋值运算符左边），此时就无法满足早期c语言的
 *     (b)定义，为此， C标准新增了一个术语： 可修改的左值。
 *     例：
 *        int a ; a是一个可修改的左值。const int a;这是一个不可修改的左值。
 *     
 *  (3)右值
 *      
 *      右值（rvalue） 指的是能赋值给可修改左值的量， 且本身不是左值。
 *      右值可以是常量、 变量或其他可求值的表达式（如， 函数调用） 。 
 *      实际上， 当前c标准在描述可求值的表达式这一概念时使用的是表达式的值（value ofan expression） ， 而不是右值。
 *      例：
 *         bmw = 2002; 2002是右值。
 *         C = 2*(A+B); 此时右值是2*(A+B)我们也会称它表达式的值。
 *          
 */
