
/*
 * 数据对象、 左值、 右值、 和运算符的概念
 *  
 *  (1)数据表达式与数据对象
 * 
 *    赋值表达式语句的目的是把值储存到内存位置上。 用于储存值的数据存储区域统称为数据对象（data object） 。
 *  例：
 *     int a; a = 3; 此时a是数据对象
 * 
 *  (2)左值
 *     
 *     左值（lvalue） 是 C 语言的术语， 用于标识特定数据对象的名称或表达式。 因此， 对象指的是实际的数据存储，
 *     而左值是用于标识或定位存储位置的标签。可以简单的理解位等号左边的值。
 *   例：
 *     int a; a = 3; 此时a是左值，又是数据对象。具体而言，a是这个存储位置的标签，我们知道a是说的这块存储的位置。
 *      
 *     对于早期的C语言来说左值意味着
 *     a.它指定一个对象， 所以引用内存中的地址；
 *     b.它可用在赋值运算符的左侧， 左值（lvalue） 中的l源自left，左值是可以更改的。
 *     
 *     对于c89来说引入了const限定符，用const创建的变量不可修改（不能放在赋值运算符左边），此时就无法满足早期c语言的
 *     (b)定义，为此， C标准新增了一个术语： 可修改的左值。
 *     例：
 *        int a ; a是一个可修改的左值。const int a;这是一个不可修改的左值。
 *     
 *  (3)右值
 *      
 *      右值（rvalue） 指的是能赋值给可修改左值的量， 且本身不是左值。
 *      右值可以是常量、 变量或其他可求值的表达式（如， 函数调用） 。 
 *      实际上， 当前c标准在描述可求值的表达式这一概念时使用的是表达式的值（value ofan expression） ， 而不是右值。
 *      例：
 *         bmw = 2002; 2002是右值。
 *         C = 2*(A+B); 此时右值是2*(A+B)我们也会称它表达式的值。
 *          
 */


/*
 * 一元运算符与二元运算符。
 * 一元运算符的概念：
 *                  a.一元运算符只需要一个运算对象。例如 rocky = –12; rocky = +12; 这种符号运算符。
 *                  b.在c90之前只有- 这个符号运算符，在c90之后才有+这种符号运算符
 * 二元运算符的概念：
 *                 需要两个运算对象才能完成操作 。例如 a = b + c; a = b - c;里面的+/-加减运算符
 */

/*
 * 运算优先级从高到低：
 *  () 
 *  + - (符号运算符，一元)
 *  * / (二元运算符)
 *  + - (加减二元运算符)
 *  = 赋值运算符
 *
 * 优先级与求值顺序：
 * 
 *  y = 6 * 12 + 5 * 20;
 * 
 *  按照我们的理解 6*12 与 5*20的优先级大于 + 与 = 。所以第一部这个表达式会化简成为 y = 72 + 100;
 *  然后再进行加法运算。但是， 优先级并未规定到底先进行哪一个乘法。 C 语言把主动权留给语言的实现者， 
 *  根据不同的硬件来决定先计算前者还是后者。 可能在一种硬件上采用某种方案效率更高， 而在另一种硬件上
 *  采用另一种方案效率更高。 无论采用哪种方案， 表达式都会简化为 72 + 100， 所以这并不影响最终的结果。
 * 
 *  你可能会说不是一般都是从左到右运算的结合律运算吗？但结合律只适用于共享同一运算对象运算符。
 *  例：
 *      12 / 3 *2中， /和*运算符的优先级相同， 共享运算对象3。 因此， 从左往右的结合律在这种情况起作用。 
 *      但y = 6 * 12 + 5 * 20;中两个*没有共享对象。所以不适合这种情况。
 * 
 *          
 */